# -*- coding: utf-8 -*-
'''
#=====================================================================================
#                        get_features.py
#                             by ikko OTA
#                             Last change : 11/12/2016
#=====================================================================================

株価データ群からfeaturesを作成するプログラム。入力は分時刻みの株価データ群。
feature = [open,high, low, close, Volume, ratio]

＊会社ごとの手続き
０：辞書などを初期化する。
１：データを上から読み込む。
２：dict[date]＝[value8:30,value8:31...,value17:00]なる、ある日の分時株価リストの辞書を作る。
３：同じ仕方で出来高辞書を作る。
４：二つの辞書から日あたりの４値と出来高のベクトルをつくる。
５：前日比をベクトルに追加する。
６：できあがったベクトルを素性リストに追加する。


'''

#-------------------------------------------------------------------------------------
#                        import
#-------------------------------------------------------------------------------------


import csv
import pandas as pd
import numpy as np

#-------------------------------------------------------------------------------------
#                        variable
#-------------------------------------------------------------------------------------

filename = "/mnt/mqs02/home/ikko/work/E2L/resorce/numerical/dow30/AA.2005-2014.txt"

#-------------------------------------------------------------------------------------
#                        def functions
#-------------------------------------------------------------------------------------

df = pd.read_csv(filename,
                   sep=';',
                   names=('Company','Date','Time','Price', 'Q','contract'),
                   delimiter='\t',
                   header = None,
                   parse_dates="Date")

#Convert Series into OHLC
ohlc = pd.Series(df['Price']).resample('H', how='ohlc')
print(ohlc)
